In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('D:\\Py files\\Data Cleaning and Preprocessing\\salary.xlsx', index_col=0)

In [3]:
df

             income
name
Rob            5000
Rafiq          6000
Nina           4000
Sofia          7500
Mohan          8000
Tao            7000
Elon Musk  10000000

In [4]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [5]:
df.income.quantile(0.25)

5500.0

In [6]:
percentile_99 = df.income.quantile(.99)
percentile_99

9400479.999999994

In [7]:
df_no_outlier = df[df.income <= percentile_99]
df_no_outlier

       income
name
Rob      5000
Rafiq    6000
Nina     4000
Sofia    7500
Mohan    8000
Tao      7000

In [8]:
df

             income
name
Rob            5000
Rafiq          6000
Nina           4000
Sofia          7500
Mohan          8000
Tao            7000
Elon Musk  10000000

In [11]:
import numpy as np

df['income'] = df['income'].astype(float)
df['income'][4] = np.NaN

In [12]:
df

               income
name
Rob            5000.0
Rafiq          6000.0
Nina           4000.0
Sofia          7500.0
Mohan             NaN
Tao            7000.0
Elon Musk  10000000.0